import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.font_manager import FontProperties

plt.rcParams['font.sans-serif'] = ['SimHei']  # 使用黑体
plt.rcParams['axes.unicode_minus'] = False  # 正常显示负号

data = {
    '总数': [1, 1, -0.637, -0.086, 1, -0.245, 1, -0.496, 1],
    '抓取累计数': [1, 1, -0.637, -0.086, 1, -0.245, 1, -0.496, 1],
    '抓取异常_计数': [-0.637, -0.637, 1, -0.053, -0.637, 0.011, -0.637, -0.239, -0.637],
    '推出异常_计数': [-0.086, -0.086, -0.053, 1, -0.086, -0.142, -0.086, -0.021, -0.086],
    '推出累计数': [1, 1, -0.637, -0.086, 1, -0.245, 1, -0.496, 1],
    '安装异常_计数': [-0.245, -0.245, 0.011, -0.142, -0.245, 1, -0.245, -0.136, -0.245],
    '安装累计数': [1, 1, -0.637, -0.086, 1, -0.245, 1, -0.496, 1],
    '检测异常_计数': [-0.496, -0.496, -0.239, -0.021, -0.496, -0.136, -0.496, 1, -0.496],
    '检测累计数': [1, 1, -0.637, -0.086, 1, -0.245, 1, -0.496, 1]
}

df = pd.DataFrame(data, index=['总数', '抓取累计数', '抓取异常_计数', '推出异常_计数', '推出累计数', '安装异常_计数', '安装累计数', '检测异常_计数', '检测累计数'])

plt.figure(figsize=(10, 8))
sns.heatmap(df, annot=True, fmt=".3f", cmap='coolwarm', cbar_kws={'label': '相关系数'}, linewidths=.5)

plt.title('热力图')

plt.show()